201_3dDamBreak/003_3dDamBreak_inerFoam_refineMesh/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2006
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/
residuals
{   
	type            solverInfo;
  libs            (utilityFunctionObjects);
	fields          (".*");
}
// ************************************************************************* //
