201_3dDamBreak/003_3dDamBreak_inerFoam_refineMesh/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun_mesh
./Allrun_solv
./Allrun_plot
#------------------------------------------------------------------------------
