201_3dDamBreak/003_3dDamBreak_inerFoam_refineMesh/Allrun_plot
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

gnuplot gnuplot/003_multiplotPpng.gp
gnuplot gnuplot/103_multiplotHpng.gp
#------------------------------------------------------------------------------
